<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Tableau Desktop disk image.</string>
	<key>Identifier</key>
	<string>com.github.primalcurve.primalcurve-recipes.download.tableaudesktop_version</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>10</string>
        <key>MINOR_VERSION</key>
        <string>1</string>
        <key>NAME</key>
        <string>TableauDesktop</string>
        <key>DOWNLOAD_URL</key>
        <string>https://downloads.tableau.com/esdalt/</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.tableau.com/support/releases</string>
                <key>re_pattern</key>
                <string>%MAJOR_VERSION%.%MINOR_VERSION%(.[0-9-]*)</string>
                <key>result_output_var_name</key>
                <string>release</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%MAJOR_VERSION%-%MINOR_VERSION%-%release%.dmg</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%%MAJOR_VERSION%.%MINOR_VERSION%.%release%/</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Tableau Software, Inc. (QJ4XPRK37C)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/Tableau Desktop.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
