<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Copies Python2.mpkg from the dmg downloaded.</string>
	<key>Identifier</key>
	<string>com.github.primalcurve.pkg.Python2</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Python2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.primalcurve.download.Python3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>source_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
	</array>
</dict>
</plist>
