<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Extensis Universal Type Client 6.</string>
	<key>Identifier</key>
	<string>com.github.primalcurve.download.UniversalTypeClient6</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>UniversalTypeClient6</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(?P&lt;url&gt;https://bin.extensis.com/UTC-6-[0-9\-]*-M\.zip)</string>
				<key>url</key>
				<string>https://www.extensis.com/support/product-support/universal-type-server-6/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
		<dict>   
		    <key>Processor</key>   
		    <string>CodeSignatureVerifier</string>   
		    <key>Arguments</key>   
		    <dict>   
		        <key>input_path</key>   
		        <string>%RECIPE_CACHE_DIR%/%NAME%/Universal Type Client 6.*.pkg</string>
		        <key>expected_authority_names</key>
		        <array>
		            <string>Developer ID Installer: Extensis (J6MMHGD9D6)</string>
		            <string>Developer ID Certification Authority</string>
		            <string>Apple Root CA</string>
		        </array>
		    </dict>
		</dict>
	</array>
</dict>
</plist>
