<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads a specific version of Wireshark.</string>
    <key>Identifier</key>
    <string>com.github.primalcurve.primalcurve-recipes.download.Wireshark</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Wireshark</string>
        <key>VERSION</key>
        <string>2.4.5</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.wireshark.org/download/osx/all-versions/</string>
                <key>request_headers</key>
                <dict>
                    <key>User-Agent</key>
                    <string>Safari 8.0.2</string>
                </dict>
                <key>re_pattern</key>
                <string>(Wireshark %VERSION%.*.dmg)</string>
                <key>result_output_var_name</key>
                <string>match</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.wireshark.org/download/osx/all-versions/%match%</string>
                <key>filename</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>